Revit 2027 API
RebarFreeFormAccessor.HasValidAlignedServer Method
 Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidAlignedServer()
Public Function HasValidAlignedServer As Boolean
public:
bool HasValidAlignedServer()
member HasValidAlignedServer : unit -> bool
Return Value
Boolean
 Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace